---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.GetRibbonPanels(System.String)
source: html/eae8d4a1-1c9b-99a5-c7e8-01aca6f201b9.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.GetRibbonPanels Method

## Syntax (C#)
```csharp
public override List<RibbonPanel> GetRibbonPanels(
	string tabName
)
```

## Parameters
- **tabName** (`System.String`)